app/Controllers/Accountant.php

SELECT *
FROM `menu`
WHERE `date` = '2024-06-16'
SELECT *
FROM `meals`
WHERE `menu_id` = '428'
---
    private function orderList($date)
    {
        $menuModel = new MenuModel();
        $mealModel = new MealModel();
        $userModel = new UserModel();


        $menu = $menuModel->where('date', $date)->findAll();

        $dailyOrders = [];
        foreach ($menu as $menuItem) {
            $meals = $mealModel->where('menu_id', $menuItem['id'])->findAll();

SELECT *
FROM `users`
WHERE `role` = '2'
SELECT COUNT(*) AS `numrows`
FROM `meals`
WHERE `user_id` = '2'
SELECT SUM(`payment_amount`) AS `payment_amount`
FROM `payments`
WHERE `user_id` = '2'
 LIMIT 1
---
    public function financialInfo()
    {
        $userModel = new UserModel();
        $mealModel = new MealModel();
        $paymentModel = new PaymentModel();
        $systemDataModel = new SystemDataModel();

        $systemData = $systemDataModel->first();
        $mealPrice = $systemData['price'];

        $users = $userModel->where('role', '2')->findAll();

        $userData = [];

        foreach ($users as $user) {
            $mealCount = $mealModel->where('user_id', $user['id'])->countAllResults();
            $totalMealCost = $mealCount * $mealPrice;
            $totalPayments = $paymentModel->where('user_id', $user['id'])->selectSum('payment_amount')->first()['payment_amount'];