app/Controllers/Admin.php

SELECT *
FROM `users`
WHERE `role` = 2
SELECT *
FROM `users`
WHERE `role` = 1
SELECT *
FROM `users`
WHERE `role` = 0
---
    public function index()
    {
        $userModel = new UserModel();
        $users = $userModel->where('role', 2)->findAll();
        $accountants = $userModel->where('role', 1)->findAll();
        $admins = $userModel->where('role', 0)->findAll();