app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'testowy'
OR `email` = 'testowy'
 LIMIT 1
---
    public function processLogin()
    {
        $request = service('request');

        $usernameOrEmail = $request->getPost('username');
        $password = $request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $usernameOrEmail)->orWhere('email', $usernameOrEmail)->first();